### 1.Importing modules that interact with the database.

In [1]:
import sqlalchemy 
import pandas as pd
import psycopg2

### 2.Create a connection to the database.

In [2]:
engine = sqlalchemy.create_engine("postgresql://postgres:Candidcoco@20@localhost:5432/postgres")

### 3.Load sql extension.

In [3]:
%load_ext sql

### 4.Establish the connection.

In [4]:
%sql $engine.url

'Connected: postgres@postgres'

In [5]:
columns=['sales_id','product_name','buying_price','selling_price','sales_quantity','sales_created_at']
df = pd.DataFrame(columns=columns)

### 5.Querying tables from the database.

In [6]:
data_to_insert = %sql SELECT sales.id as sales_id, name as product_name, buying_price, selling_price, sales.quantity as sales_quantity, created_at as sales_created_at from products, sales WHERE products.id = sales.pid
for row_data in data_to_insert:
    df.loc[len(df)] = row_data
df.set_index('sales_id',inplace=True,verify_integrity=False)

 * postgresql://postgres:***@localhost:5432/postgres
1016 rows affected.

In [7]:
df.shape

(1016, 5)

In [8]:
new_df = df.append(df)
new_df.shape

(2032, 5)

### 6. Removing duplicates.

In [9]:
new_df = df.drop_duplicates()
new_df.shape

(1008, 5)

### 8. Summary Statistics.

In [10]:
df

,product_name,buying_price,selling_price,sales_quantity,sales_created_at
sales_id,,,,,
1,sweet,70.00,80.00,49,2023-06-16 00:00:00.000000
2,cake,10.00,20.00,20,2023-05-15 20:16:06.752490
3,pineapple,70.00,200.00,20,2023-05-15 20:19:13.124052
13,biscuit,60.00,80.00,5,2023-06-22 23:21:01.583379
8,biscuit,60.00,80.00,7,2023-06-22 13:01:45.094163
...,...,...,...,...,...
471,Garam Marsala,77.00,190.00,99,2023-07-28 14:40:40.307220
552,Garam Marsala,77.00,190.00,49,2023-07-28 14:40:40.307220
562,Garam Marsala,77.00,190.00,95,2023-07-28 14:40:40.307220
571,Garam Marsala,77.00,190.00,24,2023-07-28 14:40:40.307220
583,Garam Marsala,77.00,190.00,89,2023-07-28 14:40:40.307220

In [11]:
new_column = %sql ALTER TABLE products  ADD profit int

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.DuplicateColumn) column "profit" of relation "products" already exists

[SQL: ALTER TABLE products  ADD profit int]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [ ]:
values = %sql INSERT INTO products(profit) SELECT selling_price - buying_price * sales.quantity as sales_quantity FROM  products,sales
for i in values:
    df.loc[len(df)] = i
df.update(new_column,values)

 * postgresql://postgres:***@localhost:5432/postgres